{
  "backend/main.mo": "Motoko backend managing tools, submissions, collections, profiles, and admin‑gated operations with access control and slug generation.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing several frontend tool‑related components and pages.",
  "frontend/index.css": "Tailwind CSS base file defining theme variables and light/dark mode styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Application router defining public and admin routes with admin protection and layout integration.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access‑denied message with a link back to the home page.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Protects admin routes by checking Internet Identity authentication and backend admin status.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login and logout with state feedback.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with disclaimer, copyright text, and external link.",
  "frontend/src/components/layout/Header.tsx": "Site header with navigation, search bar, mobile menu, CTA, and login button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout with header, footer, and routed content via Outlet.",
  "frontend/src/components/legal/Disclaimer.tsx": "Renders a styled disclaimer text pulled from i18n.",
  "frontend/src/components/navigation/Breadcrumbs.tsx": "Displays a breadcrumb navigation trail with optional links and separators.",
  "frontend/src/components/newsletter/NewsletterSignup.tsx": "Provides a newsletter signup form with email validation and subscription mutation.",
  "frontend/src/components/pagination/Pagination.tsx": "Implements a pagination UI with page buttons, ellipsis handling, and navigation controls.",
  "frontend/src/components/tools/PricingBadge.tsx": "Shows a colored badge representing a tool’s pricing tier.",
  "frontend/src/components/tools/SimilarToolsGrid.tsx": "Displays a grid of similar tools using ToolCard components.",
  "frontend/src/components/tools/ToolCard.tsx": "Renders a card showing a tool’s details, pricing badge, and link to its page or official site.",
  "frontend/src/components/tools/ToolsSearchFilterBar.tsx": "Offers search input, filter buttons, and sort options for browsing tools.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useAdmin.ts": "Provides admin-related queries and mutations for tools, submissions, and newsletter data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login flow, and provides identity context to the app.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating tool, collection, and newsletter data via the backend actor.",
  "frontend/src/hooks/useSeo.ts": "Updates document title, meta description, and optional JSON-LD tags on mount and cleans up on unmount.",
  "frontend/src/i18n/en.ts": "Defines English translation strings for UI sections including header, home, tools, submit, newsletter, and footer.",
  "frontend/src/i18n/index.ts": "Exports a simple translation function that resolves dot‑separated keys using the English dictionary.",
  "frontend/src/index.css": "Configures Tailwind CSS base layers, color variables, dark mode overrides, and global typography styles.",
  "frontend/src/lib/constants.ts": "Lists allowed categories, pricing tags, and pricing badge colors for tool metadata.",
  "frontend/src/lib/csv.ts": "Parses CSV text into rows with error tracking, including a custom CSV line parser handling quotes and commas.",
  "frontend/src/lib/export/csvExport.ts": "Converts 2D string arrays to downloadable CSV files using a Blob and temporary link.",
  "frontend/src/lib/seo/jsonLd.ts": "Generates JSON-LD snippets for tools and breadcrumb navigation based on schema.org formats.",
  "frontend/src/lib/validation/toolValidation.ts": "Validates tool submission fields, checks URLs, word counts, allowed values, and provides normalization helpers.",
  "frontend/src/main.tsx": "Initializes React root, sets up QueryClient and InternetIdentityProvider, and renders the main App.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About page with mission details and disclaimer while applying SEO metadata.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin landing page linking to tool management, bulk upload, submissions, and newsletter sections.",
  "frontend/src/pages/admin/AdminToolsPage.tsx": "Admin interface for browsing, searching, and deleting tools with a table view and status indicators.",
  "frontend/src/pages/admin/BulkUploadPage.tsx": "Provides a CSV upload interface for tools, validates each row, displays results, and uploads valid tools via an admin mutation.",
  "frontend/src/pages/admin/NewsletterAdminPage.tsx": "Fetches newsletter subscriber emails, displays them in a table, and allows exporting the list to CSV.",
  "frontend/src/pages/admin/SubmissionsReviewPage.tsx": "Lists pending tool submissions and enables admins to approve or reject each entry with feedback.",
  "frontend/src/pages/CategoriesPage.tsx": "Shows a grid of allowed categories linking to filtered tools and sets page SEO metadata.",
  "frontend/src/pages/CollectionDetailPage.tsx": "Fetches and displays a single collection with its tools, handles loading and not-found states, and sets SEO.",
  "frontend/src/pages/CollectionsPage.tsx": "Lists featured collections with links to detail pages, includes loading state, and sets SEO metadata.",
  "frontend/src/pages/HomePage.tsx": "Landing page that loads featured tools, collections, and newest tools while rendering hero content and navigation links.",
  "frontend/src/pages/SubmitToolPage.tsx": "Form page allowing users to submit a tool with validation and mutation handling, showing success or error toasts.",
  "frontend/src/pages/ToolDetailPage.tsx": "Displays detailed information for a single tool, sets SEO metadata, and loads similar tools with breadcrumb navigation.",
  "frontend/src/pages/ToolsListingPage.tsx": "Lists tools with pagination, search, filters, and sorting, switching between paginated and search results.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, supporting both query strings and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended colors, typography, container queries, animations, and theme customizations.",
  "project_state.json": "Project state file describing current features, requirements, architecture notes, and version metadata."
}